docs/loadtest/raw/20260227-extreme-local/ab_raw/scan_post_message_c350.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 200 requests
Completed 400 requests
Completed 600 requests
Completed 800 requests
Completed 1000 requests
Completed 1200 requests
Completed 1400 requests
Completed 1600 requests
Completed 1800 requests
Completed 2000 requests
Finished 2000 requests


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            6688

Document Path:          /api/chats/13
Document Length:        Variable

Concurrency Level:      350
Time taken for tests:   0.711 seconds
Complete requests:      2000
Failed requests:        0
Keep-Alive requests:    2000
Total transferred:      1007605 bytes
Total body sent:        1442000
HTML transferred:       313994 bytes
Requests per second:    2814.10 [#/sec] (mean)
Time per request:       124.374 [ms] (mean)
Time per request:       0.355 [ms] (mean, across all concurrent requests)
Transfer rate:          1384.52 [Kbytes/sec] received
                        1981.41 kb/s sent
                        3365.94 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   3.6      0      31
Processing:    15  115  13.8    120     137
Waiting:        2  115  13.8    120     137
Total:         18  117  12.8    120     148

Percentage of the requests served within a certain time (ms)
  50%    120
  66%    122
  75%    124
  80%    124
  90%    127
  95%    129
  98%    138
  99%    141
 100%    148 (longest request)